; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 195)
	(= (data Planet4 thermograph1) 285)
	(= (data Star5 thermograph1) 149)
	(= (data Star6 thermograph1) 196)
	(= (data Star7 thermograph1) 288)
	(= (data Planet8 thermograph1) 145)
	(= (data Planet9 thermograph1) 143)
	(= (data Planet10 thermograph1) 110)
	(= (data Star11 thermograph1) 178)
	(= (data Planet4 thermograph0) 296)
	(= (data Star5 thermograph0) 54)
	(= (data Star6 thermograph0) 168)
	(= (data Star7 thermograph0) 245)
	(= (data Planet8 thermograph0) 286)
	(= (data Planet9 thermograph0) 193)
	(= (data Planet10 thermograph0) 35)
	(= (data Star11 thermograph0) 83)
	(= (data Planet4 thermograph2) 118)
	(= (data Star5 thermograph2) 179)
	(= (data Star6 thermograph2) 277)
	(= (data Star7 thermograph2) 169)
	(= (data Planet8 thermograph2) 84)
	(= (data Planet9 thermograph2) 115)
	(= (data Planet10 thermograph2) 64)
	(= (data Star11 thermograph2) 160)
	(= (slew_time Star2 Star0) 18.68)
	(= (slew_time Star0 Star2) 18.68)
	(= (slew_time Star2 GroundStation1) 35.5)
	(= (slew_time GroundStation1 Star2) 35.5)
	(= (slew_time GroundStation3 Star0) 20.66)
	(= (slew_time Star0 GroundStation3) 20.66)
	(= (slew_time GroundStation3 GroundStation1) 58)
	(= (slew_time GroundStation1 GroundStation3) 58)
	(= (slew_time GroundStation3 Star2) 1.433)
	(= (slew_time Star2 GroundStation3) 1.433)
	(= (slew_time GroundStation1 Star0) 16.07)
	(= (slew_time Star0 GroundStation1) 16.07)
	(= (slew_time Planet4 Star0) 38.67)
	(= (slew_time Star0 Planet4) 38.67)
	(= (slew_time Planet4 GroundStation1) 33.02)
	(= (slew_time GroundStation1 Planet4) 33.02)
	(= (slew_time Planet4 Star2) 5.273)
	(= (slew_time Star2 Planet4) 5.273)
	(= (slew_time Planet4 GroundStation3) 14.42)
	(= (slew_time GroundStation3 Planet4) 14.42)
	(= (slew_time Star5 Star0) 51.24)
	(= (slew_time Star0 Star5) 51.24)
	(= (slew_time Star5 GroundStation1) 14.91)
	(= (slew_time GroundStation1 Star5) 14.91)
	(= (slew_time Star5 Star2) 79.09)
	(= (slew_time Star2 Star5) 79.09)
	(= (slew_time Star5 GroundStation3) 53.16)
	(= (slew_time GroundStation3 Star5) 53.16)
	(= (slew_time Star5 Planet4) 17.85)
	(= (slew_time Planet4 Star5) 17.85)
	(= (slew_time Star6 Star0) 51.63)
	(= (slew_time Star0 Star6) 51.63)
	(= (slew_time Star6 GroundStation1) 15.35)
	(= (slew_time GroundStation1 Star6) 15.35)
	(= (slew_time Star6 Star2) 24.17)
	(= (slew_time Star2 Star6) 24.17)
	(= (slew_time Star6 GroundStation3) 16.83)
	(= (slew_time GroundStation3 Star6) 16.83)
	(= (slew_time Star6 Planet4) 3.067)
	(= (slew_time Planet4 Star6) 3.067)
	(= (slew_time Star6 Star5) 58.51)
	(= (slew_time Star5 Star6) 58.51)
	(= (slew_time Star7 Star0) 3.138)
	(= (slew_time Star0 Star7) 3.138)
	(= (slew_time Star7 GroundStation1) 47.23)
	(= (slew_time GroundStation1 Star7) 47.23)
	(= (slew_time Star7 Star2) 58.9)
	(= (slew_time Star2 Star7) 58.9)
	(= (slew_time Star7 GroundStation3) 25.45)
	(= (slew_time GroundStation3 Star7) 25.45)
	(= (slew_time Star7 Planet4) 35.39)
	(= (slew_time Planet4 Star7) 35.39)
	(= (slew_time Star7 Star5) 17.92)
	(= (slew_time Star5 Star7) 17.92)
	(= (slew_time Star7 Star6) 45.59)
	(= (slew_time Star6 Star7) 45.59)
	(= (slew_time Planet8 Star0) 74.4)
	(= (slew_time Star0 Planet8) 74.4)
	(= (slew_time Planet8 GroundStation1) 58.74)
	(= (slew_time GroundStation1 Planet8) 58.74)
	(= (slew_time Planet8 Star2) 26.39)
	(= (slew_time Star2 Planet8) 26.39)
	(= (slew_time Planet8 GroundStation3) 43.67)
	(= (slew_time GroundStation3 Planet8) 43.67)
	(= (slew_time Planet8 Planet4) 87.54)
	(= (slew_time Planet4 Planet8) 87.54)
	(= (slew_time Planet8 Star5) 67.17)
	(= (slew_time Star5 Planet8) 67.17)
	(= (slew_time Planet8 Star6) 34.83)
	(= (slew_time Star6 Planet8) 34.83)
	(= (slew_time Planet8 Star7) 72.83)
	(= (slew_time Star7 Planet8) 72.83)
	(= (slew_time Planet9 Star0) 47.9)
	(= (slew_time Star0 Planet9) 47.9)
	(= (slew_time Planet9 GroundStation1) 19.97)
	(= (slew_time GroundStation1 Planet9) 19.97)
	(= (slew_time Planet9 Star2) 17.16)
	(= (slew_time Star2 Planet9) 17.16)
	(= (slew_time Planet9 GroundStation3) 20.96)
	(= (slew_time GroundStation3 Planet9) 20.96)
	(= (slew_time Planet9 Planet4) 31.25)
	(= (slew_time Planet4 Planet9) 31.25)
	(= (slew_time Planet9 Star5) 72.17)
	(= (slew_time Star5 Planet9) 72.17)
	(= (slew_time Planet9 Star6) 7.342)
	(= (slew_time Star6 Planet9) 7.342)
	(= (slew_time Planet9 Star7) 8.752)
	(= (slew_time Star7 Planet9) 8.752)
	(= (slew_time Planet9 Planet8) 29.69)
	(= (slew_time Planet8 Planet9) 29.69)
	(= (slew_time Planet10 Star0) 81.35)
	(= (slew_time Star0 Planet10) 81.35)
	(= (slew_time Planet10 GroundStation1) 73.87)
	(= (slew_time GroundStation1 Planet10) 73.87)
	(= (slew_time Planet10 Star2) 17.59)
	(= (slew_time Star2 Planet10) 17.59)
	(= (slew_time Planet10 GroundStation3) 80.45)
	(= (slew_time GroundStation3 Planet10) 80.45)
	(= (slew_time Planet10 Planet4) 36.43)
	(= (slew_time Planet4 Planet10) 36.43)
	(= (slew_time Planet10 Star5) 3.034)
	(= (slew_time Star5 Planet10) 3.034)
	(= (slew_time Planet10 Star6) 17.21)
	(= (slew_time Star6 Planet10) 17.21)
	(= (slew_time Planet10 Star7) 0.4708)
	(= (slew_time Star7 Planet10) 0.4708)
	(= (slew_time Planet10 Planet8) 0.03972)
	(= (slew_time Planet8 Planet10) 0.03972)
	(= (slew_time Planet10 Planet9) 5.5)
	(= (slew_time Planet9 Planet10) 5.5)
	(= (slew_time Star11 Star0) 51.39)
	(= (slew_time Star0 Star11) 51.39)
	(= (slew_time Star11 GroundStation1) 21.4)
	(= (slew_time GroundStation1 Star11) 21.4)
	(= (slew_time Star11 Star2) 13.22)
	(= (slew_time Star2 Star11) 13.22)
	(= (slew_time Star11 GroundStation3) 31.77)
	(= (slew_time GroundStation3 Star11) 31.77)
	(= (slew_time Star11 Planet4) 6.566)
	(= (slew_time Planet4 Star11) 6.566)
	(= (slew_time Star11 Star5) 22)
	(= (slew_time Star5 Star11) 22)
	(= (slew_time Star11 Star6) 38.95)
	(= (slew_time Star6 Star11) 38.95)
	(= (slew_time Star11 Star7) 17.65)
	(= (slew_time Star7 Star11) 17.65)
	(= (slew_time Star11 Planet8) 33.38)
	(= (slew_time Planet8 Star11) 33.38)
	(= (slew_time Star11 Planet9) 8.64)
	(= (slew_time Planet9 Star11) 8.64)
	(= (slew_time Star11 Planet10) 45.57)
	(= (slew_time Planet10 Star11) 45.57)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star6 thermograph0)
	(have_image Star7 thermograph2)
	(have_image Planet8 thermograph2)
	(have_image Planet9 thermograph0)
	(have_image Planet10 thermograph0)
	(have_image Star11 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (turn_to satellite0 star0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 195 to 113.65, (fuel-used) from 0 to 81.35
   goals met: 0 of 6
3. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 113.65 to 65.75, (fuel-used) from 81.35 to 129.25
   goals met: 0 of 6
4. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 65.75 to 56.998, (fuel-used) from 129.25 to 138.002
   goals met: 0 of 6
5. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 56.998 to 53.86, (fuel-used) from 138.002 to 141.14
   goals met: 0 of 6
6. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 53.86 to 50.722, (fuel-used) from 141.14 to 144.278
   goals met: 0 of 6
8. (take_image satellite0 star7 instrument1 thermograph2)
   added: (have_image star7 thermograph2)
   changed: (data_capacity satellite0) from 1000 to 831, (data-stored) from 0 to 169
   goals met: 1 of 6
9. (turn_to satellite0 planet10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 50.722 to 50.2512, (fuel-used) from 144.278 to 144.749
   goals met: 1 of 6
10. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 50.2512 to 50.2115, (fuel-used) from 144.749 to 144.789
   goals met: 1 of 6
11. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 50.2115 to 50.1718, (fuel-used) from 144.789 to 144.828
   goals met: 1 of 6
12. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 50.1718 to 50.132, (fuel-used) from 144.828 to 144.868
   goals met: 1 of 6
13. (take_image satellite0 planet8 instrument1 thermograph2)
   added: (have_image planet8 thermograph2)
   changed: (data_capacity satellite0) from 831 to 747, (data-stored) from 169 to 253
   goals met: 2 of 6
14. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 50.132 to 50.0923, (fuel-used) from 144.868 to 144.908
   goals met: 2 of 6
15. (take_image satellite0 planet10 instrument1 thermograph0)
   added: (have_image planet10 thermograph0)
   changed: (data_capacity satellite0) from 747 to 712, (data-stored) from 253 to 288
   goals met: 3 of 6
16. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 50.0923 to 44.5923, (fuel-used) from 144.908 to 150.408
   goals met: 3 of 6
17. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   changed: (data_capacity satellite0) from 712 to 519, (data-stored) from 288 to 481
   goals met: 4 of 6
18. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 44.5923 to 35.9523, (fuel-used) from 150.408 to 159.048
   goals met: 4 of 6
19. (take_image satellite0 star11 instrument1 thermograph2)
   added: (have_image star11 thermograph2)
   changed: (data_capacity satellite0) from 519 to 359, (data-stored) from 481 to 641
   goals met: 5 of 6
20. (turn_to satellite0 planet4 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 35.9523 to 29.3863, (fuel-used) from 159.048 to 165.614
   goals met: 5 of 6
21. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 29.3863 to 26.3193, (fuel-used) from 165.614 to 168.681
   goals met: 5 of 6
22. (take_image satellite0 star6 instrument1 thermograph0)
   added: (have_image star6 thermograph0)
   changed: (data_capacity satellite0) from 359 to 191, (data-stored) from 641 to 809
   goals met: 6 of 6
